package util_p;

import java.util.regex.Pattern;

public class RegexMain {

	public static void main(String[] args) {
		System.out.println("정우성".startsWith("정"));
		System.out.println("감우성".startsWith("정"));
		
		System.out.println(Pattern.matches("정.*", "정우성"));
		System.out.println(Pattern.matches("감.*", "정우성"));
		
		System.out.println(Pattern.matches("감", "감우성"));
		System.out.println(Pattern.matches(".*우.*", "감우성"));
		System.out.println(Pattern.matches(".*우.*", "차은우"));
		System.out.println(Pattern.matches(".*우.*", "우뢰매"));
		
		String [] mmArr = {
				"장동건","건","장서건","장혁","장남건","장3","장빈건","*","***","*******",
                "장","장군","","최장군","박장군","장군님","장장장장장장장","된장","장장","고추장",
                "미란다커","키커","쌍피","계피","원두커피장군",
                "장장장","김앤장이다","현빈","원빈","미스터빈","커피빈","커피","원두커피","장희빈",
                "ㄱㄴㄷ","ㄱㄹㄴ","ㅐㅓㅣㅔㅐ","ㅐㅔㅓㅐㅑㅓ","ㄱㅓㅔㅔㅔㄹㄴ",
                "하하하","하호허","팉툍하","하학","하햐","가긱공국","짱쩡맨","쑥ㄴ밬","샹쏑쑗",
                "다","공석호","김희애",
                "나야비","나비야","농ㅂ왕창","장ㄴ비용솽",
                "너탈비털아붕니","너비아니","헤르너비아샹쵕",
                "123-456","1234-5678",
                "1234-5678-9012","123-5678-9012","12-5678-9012","12-568-9012",
                "123-678-9012","123-567833-9012","12-58-9012","1a",
                "abc","abc_def","1234","9846","ab_1234","ab1234",
                "aaa@aaa.aaa","aaaaaa.aaa@","aaa12aaa_aaa@",
                "ab56","AABB","aBCd","aBCdeg","aB12Cdeg","aB12@Cdeg",
                "1","3","1234abc@aaa.aaa",
                "1234abc@aaa.a","1a2b","a12",
                "^","^^","12^34abc@aaa.aaa","1a2b^","^a12","123456.^",
                "\\^","^\\^",".^","\\^^",
                "+","+++++",
                "1234abc@aaa.aa.va","1234abc@a.aa.a.a.va"  	
		};
		
		String [] ppArr = {
			"장", "장군","장.", ".장", ".장.","장..",  // . : 임의의 글자1개
			"장+", "장*", "장?",	// + : 앞의 문자 1개이상, * : 앞의 문자 0개이상, ? : 앞의 문자 0~1
			"장.*",".*빈.*",
			".*빈건",".*(빈건)",".*빈|건",".*(빈|건)",".*[빈건]",
			".*(커피|장군)",".*[커피장군]",
			"[0-9]+","\\d+", 	//숫자
			"[^0-9]+","\\D+", 	//숫자제외
			"[a-z]+","[A-Z]+","[a-zA-Z]+",
			"[a-zA-Z0-9_]+","\\w+",	// 글자(숫자영문_)
			"[^a-zA-Z0-9_]+","\\W+",	// 글자(숫자영문_) 제외
			"[a-zA-Z0-9]+@[a-zA-Z0-9_.]+",
			".{4}",".{3,}",".{3,7}", //".{,7}",   글자갯수
			"\\d{2,3}-\\d{3,4}-\\d{4}",
			"[^0-9]+","[0-9^]+","^","\\^+",//"[^]+"
			"[^^]+","[\\^0-9]+",
			"\\*","\\*+",
			"[가-힣]+","[ㄱ-ㅎ]+","[ㅏ-ㅣ]+","[가-힣ㄱ-ㅎㅏ-ㅣ]+",
			".*[가-깋].*",".*[나-닣ㄴ][바-빟ㅂ][아-잏ㅇ].*",   //ㄴㅂㅇ
			
			// ?=    조건  and 연산으로 결합
			"(?=[a-z])","(?=[a-z]).*",
			"^(?=.*[a-z]+$).+",  //  ^ : 시작  $ : 끝
			"^(?=.*[A-Z]).{3,}$",  //  대문자포함 , 3글자이상
			"^(?=.*[A-Z])(?=.*[a-z]).{3,}$",//  대문자, 소문자 필수포함 , 3글자이상
			"^(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9]).{3,}$",//  대문자, 소문자, 숫자 필수포함 , 3글자이상
		};
		
		for (String pp : ppArr) {
			System.out.print(pp+" : ");
			
			for (String mm : mmArr) {
				if(Pattern.matches(pp, mm)) {
					System.out.print(mm+",");
				}
			}
			
			System.out.println();
		}
	}
}

/*
MemberJoinMain
//// 회원 가입 유효성 검사를 실시하세요
1. 아이디 : 영문 숫자 조합(4자이상)
2. 이메일  -  아이디:영문,숫자(3글자이상)   @  도메인 : 영문 점
3. 전화번호 - 숫자 :  ###-####-####,   ##(#)-###-####
4. 이름 (한글만 가능) 2~5자
5. 우편번호 검색 - 구단위 (초성검색)
예외처리로 처리할 것
 * */
