a = [12,34,56,12,78,90,34]
##   0  1  2   3  4  5  6
print('a :',a)

print('a[2]',a[2])
#print('a[7]',a[7])
print('a[-1]',a[-1])
print('a[-2]',a[-2])
# print('a[-8]',a[-8])

a[4] = 700
print('a :',a)
#a[7] = 7890

print('a[3:5]',a[3:5])  ## 슬라이싱 a[3],a[4]
print('a[:5]',a[:5])  ## 슬라이싱 a[0] ~ a[4]
print('a[3:]',a[3:])  ## 슬라이싱 a[3] ~ 끝

b = ['직사각형',5,6]
print('b :', b)

c = [12,34,56,78]
d = [34,90,78,45]
e = c+d     ## 리스트 결합
print(e)
f = c*3     ## 리스트 원소 중복
print(f)
'''
02_examList.py
2중 list로 구현하여 각 학생의 총점 평균까지 출력하세요
장동건,77,79,72
장서건,67,69,62
장남건,97,99,92
장중건,87,89,82

'''

